---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionData.GetLoops
source: html/5ce3fa96-81d0-6f32-99b9-b19cda8b8193.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionData.GetLoops Method

Gets the curve loops that form the base shape of the extrusion.

## Syntax (C#)
```csharp
public IList<CurveLoop> GetLoops()
```

## Returns
The collection of loops.